domains/mirror/pe/ofTemplates/RANS_INC/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         0.8;

deltaT          8e-07;

writeControl    runTime; 

writeInterval   8e-03;  // 12.5 kHz

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           .5; 

functions
{
     forceCoeffs
    {

    libs           ("libforces.so");
    type           forceCoeffs;

    writeControl   timeStep;
    timeInterval   1;
    log            yes;

    patches     (carMirror);
    rho         rhoInf;               // Indicates incompressible case
    rhoInf      1;
    liftDir     (0 0 1);
    dragDir     (1 0 0);
    CofR        (0.003 0.102 0.69);   // Mirror midpoint on wall
    pitchAxis   (0 0 0);
    magUInf     27.0;                 // Inlet wind speed magnitude
    lRef        0.17;       	      // length of mirror 0.17
    Aref        0.042;                // 0.3*0.14 
}

 vorticity1
 {
    type        vorticity;
    libs        ("libfieldFunctionObjects.so");
    writeControl    writeTime;
 }

yPlus1
 {
    type        yPlus;
    libs        ("libfieldFunctionObjects.so");
    writeControl    writeTime;
 }

     wallShearStress1
 {
    type        wallShearStress;
    libs        ("libfieldFunctionObjects.so");
    writeControl    writeTime;
 }

    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;

        fields
        (
	    U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}

